Tasks/Задачи_ПКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>Задачи_ПКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеСвойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеВыполненыхВопросовЧекЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбобщеннаяЗадача</Name>
					<Comment>Совместно с композицией</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.КонтрольТЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЧекЛист</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвторВыполнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/Дополнение_к_ТЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Дополнение_к_ТЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОзнакомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ознакомился</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтЗаказчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлТЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АвторДобавления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Tasks/Задачи_ПКД/Forms/ФормаДополнетельноеТЗ/Ext/Form/Module.bsl
&НаКлиенте
Перем ДатаДобавления, АвторДобавления;

&НаКлиенте
Процедура ДополнениеТЗПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.ДополнениеТЗ.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		
		ДатаОзнакомления 	= Дата(2001, 1, 1);
		ОписаниеИзменения 	= "";	
		ИмяФайла 			= "";	
		
	Иначе
		
		ДатаОзнакомления 		= ТД.ДатаОзнакомления;
		ДатаДобавления 			= ТД.ДатаДобавления;	
		АвторДобавления 		= ТД.АвторДобавления;	
		ОписаниеИзменения 		= ТД.ОписаниеИзменения;	
		ИмяФайла 				= ТД.ИмяФайла + "." + ТД.Расширение;	
	
	КонецЕсли;
	
	Элементы.ИмяФайла.Доступность 	= ?(ПустаяСтрока(ИмяФайла), Ложь, Истина);
	Элементы.Ознакомлен.Доступность = ?(ДатаОзнакомления = дата(1, 1, 1), Истина, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") И Параметры.Свойство("Комплект") Тогда
		Комплект = Параметры.Комплект;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комплект) Тогда 
		
		ЗаполнитьТаблицу();
		
	Иначе

		Отказ = Истина;	
	
	КонецЕсли;

КонецПроцедуры 

Процедура ЗаполнитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Дополнение_к_ТЗ.ДатаДобавления КАК ДатаДобавления,
		|	Дополнение_к_ТЗ.АвторДобавления КАК АвторДобавления,
		|	Дополнение_к_ТЗ.ДатаОзнакомления КАК ДатаОзнакомления,
		|	Дополнение_к_ТЗ.ЕстьФайл КАК ЕстьФайл,
		|	Дополнение_к_ТЗ.ИмяФайла КАК ИмяФайла,
		|	Дополнение_к_ТЗ.Ознакомился КАК Ознакомился,
		|	Дополнение_к_ТЗ.ОписаниеИзменения КАК ОписаниеИзменения,
		|	Дополнение_к_ТЗ.Расширение КАК Расширение,
		|	Дополнение_к_ТЗ.ФайлТЗ КАК ФайлТЗ
		|ИЗ
		|	РегистрСведений.Дополнение_к_ТЗ КАК Дополнение_к_ТЗ
		|ГДЕ
		|	Дополнение_к_ТЗ.Комплект = &Комплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДобавления";
	
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	ДополнениеТЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ОзнакомленНаСервере(Комплект, ДатаДобавления, АвторДобавления)
	
	ДатаОзнакомления 	= ТекущаяДата();
	Ознакомился 		= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи = РегистрыСведений.Дополнение_к_ТЗ.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Комплект 		= Комплект;
	МенеджерЗаписи.ДатаДобавления 	= ДатаДобавления;
	МенеджерЗаписи.АвторДобавления 	= АвторДобавления; 
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Ознакомился 		= Ознакомился;
	МенеджерЗаписи.ДатаОзнакомления = ДатаОзнакомления;
	
	МенеджерЗаписи.Записать();
	
	Возврат Новый Структура("ДатаОзнакомления, Ознакомился", ДатаОзнакомления, Ознакомился);
	
КонецФункции

&НаКлиенте
Процедура Ознакомлен(Команда)
	
	стОзнакомился = ОзнакомленНаСервере(Комплект, ДатаДобавления, АвторДобавления);
	
	Для каждого х Из ДополнениеТЗ Цикл
		
		Если НЕ х.ДатаДобавления = ДатаДобавления Тогда
			Продолжить;	
		КонецЕсли;	
		
		Если НЕ х.АвторДобавления = АвторДобавления Тогда
			Продолжить;	
		КонецЕсли;
		
		х.ДатаОзнакомления 	= стОзнакомился.ДатаОзнакомления;
		х.Ознакомился 		= стОзнакомился.Ознакомился;
		
		Прервать;
		
	КонецЦикла;
	
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПолноеИмяФайла = КаталогВременныхФайлов()  + ИмяФайла;
 	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	Если Файл.Существует() Тогда
	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытиеФайлаПродолжение", ЭтаФорма, ПолноеИмяФайла);
		
		Попытка
		
			НачатьУдалениеФайлов(ОписаниеОповещения, ПолноеИмяФайла);
			
		Исключение
			
			ПоказатьПредупреждение(, "Файл уже открыт");
			Возврат;
		
		КонецПопытки;
		
	Иначе
		
		ОткрытиеФайлаПродолжение(ПолноеИмяФайла);
	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОткрытиеФайлаПродолжение(ПолноеИмяФайла) Экспорт

	АдресВХ = ПолучитьАдресВременногоХранилища(Комплект, ДатаДобавления, АвторДобавления, ИмяФайла);
	
	Если ПустаяСтрока(АдресВХ) Тогда
		
		ПоказатьПредупреждение(, "Файл не найден");
		
	Иначе
		
		Двоичное = ПолучитьИзВременногоХранилища(АдресВХ);  // по адресу временного хранилища получаем двоичные данные
		Двоичное.Записать(ПолноеИмяФайла);
		
		ЗапуститьПриложение(ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры // ОткрытиеФайлаПродолжение()  

&НаСервереБезКонтекста
Функция ПолучитьАдресВременногоХранилища(Комплект, ДатаДобавления, АвторДобавления, ИмяФайла)

	ДатаОзнакомления 	= ТекущаяДата();
	Ознакомился 		= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи = РегистрыСведений.Дополнение_к_ТЗ.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Комплект 		= Комплект;
	МенеджерЗаписи.ДатаДобавления 	= ДатаДобавления;
	МенеджерЗаписи.АвторДобавления 	= АвторДобавления; 
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.ЕстьФайл Тогда
		
		ПолноеИмяФайла = КаталогВременныхФайлов()  + ИмяФайла;
		
		ДвоичныеДанные = МенеджерЗаписи.ФайлТЗ.Получить();
		
		Если ДвоичныеДанные = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		ДвоичныеДанные.Записать(ПолноеИмяФайла);
		
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайла));
		
		УдалитьФайлы(ПолноеИмяФайла);
		
		Возврат Адрес;
		
	КонецЕсли;
	
	
	Возврат "";
	
КонецФункции // ПолучитьАдресВременногоХранилища()
